tap "charmbracelet/tap"
tap "cooklang/tap"
tap "denisidoro/tools"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jondot/tap"
tap "ms-jpq/sad"
tap "neovim/neovim"
tap "ttscoff/thelab"
tap "universal-ctags/universal-ctags"
# Search tool like grep, but optimized for programmers
brew "ack"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Library and utilities for processing GIFs
brew "giflib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Record and share terminal sessions
brew "asciinema"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# BibTeX bibliography file pretty printer and syntax checker
brew "bibclean"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Freely available high-quality data compressor
brew "bzip2"
# Statistics utility to count lines of code
brew "cloc"
# JavaScript optimizing compiler
brew "closure-compiler"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Header-only library for parsing TOML
brew "cpptoml"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Tools to convert fonts from OTF/TTF to EOT format
brew "eot-utils"
# Modern replacement for 'ls'
brew "exa"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image manipulation library
brew "jpeg", link: true
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Static type checker for JavaScript
brew "flow"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Alias for git commit --fixup <ref>
brew "git-fixup"
# Git extension for versioning large files
brew "git-lfs"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Network related modules for glib
brew "glib-networking"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Testing and Mocking Framework
brew "googletest"
# Version Control Visualization Tool
brew "gource"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# Numerical library for C and C++
brew "gsl"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Instant coding answers via the command-line
brew "howdoi"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Peer-to-peer hypermedia protocol
brew "ipfs", restart_service: true
# Command-line pager for JSON data
brew "jless"
# Simple terminal UI for git commands
brew "lazygit"
# Open h.265 video codec implementation
brew "libde265"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Conversion library
brew "libiconv"
# Implementation of the Double Ratchet cryptographic ratchet
brew "libolm"
# HTTP client/server library for GNOME
brew "libsoup"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Friendly wrapper for launchctl
brew "lunchy"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached"
# UNIX movie player
brew "mplayer"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Simplistic interactive filtering tool
brew "peco"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Generic syntax highlighter
brew "pygments"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Messaging broker
brew "rabbitmq"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Make aliases for Ruby versions
brew "rbenv-aliases"
# Safely sets global and per-project environment variables
brew "rbenv-vars"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Convert between TOML, YAML and JSON
brew "remarshal"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# JVM-based programming language
brew "scala"
# Create beautiful image of your source code
brew "silicon"
# Convert filenames and directories to a web friendly format
brew "slugify"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Open source continuous file synchronization application
brew "syncthing"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Command-line tool for sharing terminal over the web
brew "ttyd", args: ["HEAD"]
# URL extractor/launcher
brew "urlview"
# Syntax-aware linter for prose
brew "vale"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# Plain text note-taking assistant
brew "zk"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A tasty, self-hostable Git server for the command line🍦
brew "charmbracelet/tap/soft-serve"
# A tool for recording terminal GIFs
brew "charmbracelet/tap/vhs"
# The SSH directory
brew "charmbracelet/tap/wishlist"
# CLI tool for CookLang Recipe Markup Language
brew "cooklang/tap/cook"
# Turns macOS input fields into real vim buffers
brew "felixkratz/formulae/svim"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# The scalable code generator that saves you time.
brew "jondot/tap/hygen"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Application launcher and productivity software
cask "alfred"
# Network scanner
cask "angry-ip-scanner"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# All-In-One Toolkit for Working Remotely
cask "basecamp"
# Edit and manage bibliographies
cask "bibdesk"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# 3D model editor for boxy models and pixel art textures
cask "blockbench"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser"
# Web browser focusing on privacy
cask "brave-browser-beta"
# Web browser focusing on privacy
cask "brave-browser-dev"
# Web browser focusing on privacy
cask "brave-browser-nightly"
# E-books management software
cask "calibre"
cask "color-oracle"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Disk space visualizer
cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash"
# Peer to peer data sharing app built for humans
cask "dat"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Trains AIs to understand and translate texts
cask "deepl"
# Collect, organize, edit and annotate documents
cask "devonthink"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Find files, folders, or contents in any file
cask "easyfind"
# Matrix collaboration client
cask "element"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox-nightly"
cask "flip4mac"
# Download manager with a torrent client
cask "folx"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# 3D parametric modeler
cask "freecad"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Virtual globe
cask "google-earth-pro"
cask "google-japanese-ime"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Tool to scan a website checking for broken links
cask "integrity"
# Menu bar application for the IPFS peer-to-peer network
cask "ipfs"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Keyboard customizer
cask "karabiner-elements"
# End-to-end encryption software
cask "keybase"
# Open-source keystroke visualizer
cask "keycastr"
# Interface for reading and syncing eBooks
cask "kindle"
# GPU-based terminal emulator
cask "kitty"
# Official client for LBRY, a decentralised file-sharing and payment network
cask "lbry"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# 2D game framework for Lua
cask "love"
# 8-bit 3D voxel editor and interactive path tracing renderer
cask "magicavoxel"
# Video format converter (transcoder)
cask "makemkv"
# Previewer for Markdown, MultiMarkdown and other text markup languages
cask "marked"
# Timer application
cask "michaelvillar-timer"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Minimal installer for conda
cask "miniconda"
# Neovim Client
cask "neovide"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera"
# Web browser
cask "opera-beta"
# Web browser
cask "opera-developer"
# Play PC games and connect with your friends
cask "origin"
# Control your smart light system
cask "philips-hue-sync"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# All-in-one bookmark manager
cask "raindropio"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# Web browser
cask "safari-technology-preview"
# Block your own access to distracting websites
cask "selfcontrol"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Onion routing based messenger
cask "session"
# EPUB ebook editor
cask "sigil"
# Instant messaging application focusing on security
cask "signal"
# Draw, paint, & sketch application
cask "sketchbook"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Tool to render realistic skies in real time on the screen
cask "stellarium"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# General-purpose text editor
cask "textmate"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# File transfer application
cask "transmit"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Font manager application
cask "typeface"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Web browser plugin
cask "vlc-webplugin"
cask "webponize"
# Torrent streaming application
cask "webtorrent"
# Network diagnostic utility
cask "whatroute"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1-Click Video Converter", id: 717545086
mas "Be Focused Pro", id: 961632517
mas "Bitwarden", id: 1352778147
mas "Boop", id: 1518425043
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Fluent Reader", id: 1520907427
mas "Free MP4 Converter", id: 693443591
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iA Writer", id: 775737590
mas "Icon Slate", id: 439697913
mas "iFinance 5", id: 1500241909
mas "iMovie", id: 408981434
mas "IP Friend", id: 1560408065
mas "Just Focus", id: 1142151959
mas "Keynote", id: 409183694
mas "Kiwix", id: 1275066656
mas "LanguageTool", id: 1534275760
mas "Marked 2", id: 890031187
mas "Mela", id: 1568924476
mas "Microsoft To Do", id: 1274495053
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixave", id: 924891282
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Time Sink", id: 404363161
mas "Typeface", id: 1062679359
mas "Vectornator", id: 1219074514
mas "Yoink", id: 457622435
