tap "charmbracelet/tap"
tap "cooklang/tap"
tap "denisidoro/tools"
tap "dustinblackman/tap"
tap "dwarvesf/tap"
tap "espanso/espanso"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "jondot/tap"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "micnncim/tap"
tap "ms-jpq/sad"
tap "neovim/neovim"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pkgxdev/made"
tap "supabase/tap"
tap "ttscoff/thelab"
tap "universal-ctags/universal-ctags"
# Search tool like grep, but optimized for programmers
brew "ack"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# ChatGPT cli
brew "aichat"
# Library and utilities for processing GIFs
brew "giflib"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Record and share terminal sessions
brew "asciinema"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# BibTeX bibliography file pretty printer and syntax checker
brew "bibclean"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Collection of portable C++ source libraries
brew "boost"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# High performance message passing library
brew "open-mpi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Statistics utility to count lines of code
brew "cloc"
# JavaScript optimizing compiler
brew "closure-compiler"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Graphics library to dynamically manipulate images
brew "gd"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Header-only library for parsing TOML
brew "cpptoml"
# Reimplementation of ctags(1)
brew "ctags"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", restart_service: true
# .NET Core
brew "dotnet"
# More intuitive version of du in rust
brew "dust"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Tools to convert fonts from OTF/TTF to EOT format
brew "eot-utils"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Thrift functions for querying information from a service
brew "fb303"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Optimized BLAS library
brew "openblas"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Static type checker for JavaScript
brew "flow"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Alias for git commit --fixup <ref>
brew "git-fixup"
# Git extension for versioning large files
brew "git-lfs"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# OpenGL Extension Wrangler Library
brew "glew"
# Network related modules for glib
brew "glib-networking"
# C++ mathematics library for graphics software
brew "glm"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Google Testing and Mocking Framework
brew "googletest"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# Numerical library for C and C++
brew "gsl"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Generic syntax highlighter
brew "pygments"
# Instant coding answers via the command-line
brew "howdoi"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Open h.265 video codec implementation
brew "libde265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Command-line pager for JSON data
brew "jless"
# Image manipulation library
brew "jpeg", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Conversion library
brew "libiconv"
# Implementation of the Double Ratchet cryptographic ratchet
brew "libolm"
# C library for the Public Suffix List
brew "libpsl"
# HTTP client/server library for GNOME
brew "libsoup"
# Linux virtual machines
brew "lima"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Next-gen compiler infrastructure
brew "llvm"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Friendly wrapper for launchctl
brew "lunchy"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached"
# UNIX movie player
brew "mplayer"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Open Fortinet client for PPP+TLS VPN tunnel services
brew "openfortivpn"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# QR Code generation
brew "qrencode"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Messaging and streaming broker
brew "rabbitmq"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Make aliases for Ruby versions
brew "rbenv-aliases"
# Safely sets global and per-project environment variables
brew "rbenv-vars"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Convert between TOML, YAML and JSON
brew "remarshal"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# JVM-based programming language
brew "scala"
# Create beautiful image of your source code
brew "silicon"
# Convert filenames and directories to a web friendly format
brew "slugify"
# Compression/decompression tool based on snappy
brew "snzip"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Open source continuous file synchronization application
brew "syncthing"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Command-line tool for sharing terminal over the web
brew "ttyd", args: ["HEAD"]
# TUI for Mastodon with vim inspired keys
brew "tut"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# URL extractor/launcher
brew "urlview"
# Compiler for the GObject type system
brew "vala"
# Syntax-aware linter for prose
brew "vale"
# Image processing library
brew "vips"
# Watch files and take action when they change
brew "watchman"
# Command-line tool to track (your) time
brew "watson"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Command-line fuzzy finder that prioritizes matches on filenames
brew "zf"
# Plain text note-taking assistant
brew "zk"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A tasty, self-hostable Git server for the command line🍦
brew "charmbracelet/tap/soft-serve"
# A tool for recording terminal GIFs
brew "charmbracelet/tap/vhs"
# The SSH directory
brew "charmbracelet/tap/wishlist"
# CLI tool for CookLang Recipe Markup Language
brew "cooklang/tap/cook"
# Terminal UI to chat with large language models (LLM) using backends such as Ollama, and direct integrations with your favourite editor like Neovim!
brew "dustinblackman/tap/oatmeal"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# The scalable code generator that saves you time.
brew "jondot/tap/hygen"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Run Anything
brew "pkgxdev/made/pkgx"
# Supabase CLI
brew "supabase/tap/supabase"
# Time tracker
cask "activitywatch"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Network scanner
cask "angry-ip-scanner"
# Webcam & audio device software
cask "ankerwork"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organiser
cask "bartender"
# All-In-One Toolkit for Working Remotely
cask "basecamp"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Edit and manage bibliographies
cask "bibdesk"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# 3D performance benchmarking tool
cask "blender-benchmark"
# Utility to dim background/inactive content in the screen
cask "blurred"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser"
# Automation tool
cask "bunch"
# E-books management software
cask "calibre"
# Screen capturing tool
cask "cleanshot"
cask "color-oracle"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Disk space visualiser
cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash"
# Peer to peer data sharing app built for humans
cask "dat"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Trains AIs to understand and translate texts
cask "deepl"
# Collect, organise, edit and annotate documents
cask "devonthink"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Find files, folders, or contents in any file
cask "easyfind"
# Matrix collaboration client
cask "element"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox-nightly"
# Download manager with a torrent client
cask "folx"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
# Superfamily of fonts for code
cask "font-monaspace"
cask "font-noto-emoji"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Free VPN client for FortiClient
cask "forticlient-vpn"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake"
# Utility to hide menu bar items
cask "hiddenbar"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Tool to scan a website checking for broken links
cask "integrity"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Open-source keystroke visualiser
cask "keycastr"
# Interface for reading and syncing eBooks
cask "kindle"
# GPU-based terminal emulator
cask "kitty"
# Grammar, spelling and style suggestions in all the writing apps
cask "languagetool"
# Official client for LBRY, a decentralised file-sharing and payment network
cask "lbry"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Client for LLaMA models
cask "llamachat"
# Discover, download, and run local LLMs
cask "lm-studio"
# File system integration
cask "macfuse"
# 8-bit 3D voxel editor and interactive path tracing renderer
cask "magicavoxel"
# Video format converter (transcoder)
cask "makemkv"
# Previewer for Markdown, MultiMarkdown and other text markup languages
cask "marked"
# Timer application
cask "michaelvillar-timer"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Email client
cask "microsoft-outlook"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Organise all your reference images in one place
cask "ogdesign-eagle"
# Web browser
cask "opera"
# Web browser
cask "opera-beta"
# Web browser
cask "opera-developer"
# Play PC games and connect with your friends
cask "origin"
# Control your smart light system
cask "philips-hue-sync"
# Colour picker for colours onscreen
cask "pika"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# All-in-one bookmark manager
cask "raindropio"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Web browser
cask "safari-technology-preview"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Onion routing based messenger
cask "session"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Draw, paint, & sketch application
cask "sketchbook"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Tool to render realistic skies in real time on the screen
cask "stellarium"
# Interior design application
cask "sweet-home3d"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Unpacks archive files
cask "the-unarchiver"
# Customizable timing of breaks
cask "time-out"
# Web browser focusing on security
cask "tor-browser"
# File transfer application
cask "transmit"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Web browser plugin
cask "vlc-webplugin"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network diagnostic utility
cask "whatroute"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
mas "1-Click Video Converter", id: 717545086
mas "Aiko", id: 1672085276
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Draw Things", id: 6444050820
mas "Free MP4 Converter", id: 693443591
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iA Writer", id: 775737590
mas "Icon Slate", id: 439697913
mas "iFinance 5", id: 1500241909
mas "iMovie", id: 408981434
mas "IP Friend", id: 1560408065
mas "Just Focus", id: 1142151959
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanguageTool", id: 1534275760
mas "Marked 2", id: 890031187
mas "Mela", id: 1568924476
mas "Microsoft To Do", id: 1274495053
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixave", id: 924891282
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
mas "Smart Converter", id: 447513724
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Time Sink", id: 404363161
mas "Typeface", id: 1062679359
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
vscode "activitywatch.aw-watcher-vscode"
vscode "adamvoss.vscode-languagetool"
vscode "akamud.vscode-caniuse"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "anteprimorac.html-end-tag-labels"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "chrischinchilla.vale-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "codesandbox-io.codesandbox-projects"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "cstrachan.vcard"
vscode "davidlday.languagetool-linter"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fallenmax.mithril-emmet"
vscode "file-icons.file-icons"
vscode "foam.foam-vscode"
vscode "gerane.theme-tomorrownight"
vscode "ginfuru.better-nunjucks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hextorgb.hex-to-rgb"
vscode "idleberg.applescript"
vscode "jasonnutter.search-node-modules"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "kamikillerto.vscode-colorize"
vscode "kumar-harsh.graphql-for-vscode"
vscode "liviuschera.noctis"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mehullakhanpal.file-ops"
vscode "mgmcdermott.vscode-language-babel"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-attrs-sorter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "sleistner.vscode-fileutils"
vscode "softwaredotcom.swdc-vscode"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "thenikso.github-plus-theme"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "xyc.vscode-mdx-preview"
vscode "yinfei.luahelper"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
