tap "dustinblackman/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ms-jpq/sad"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Record and share terminal sessions
brew "asciinema"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Console-based Audio Visualizer for ALSA
brew "cava"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library and utilities for processing GIFs
brew "giflib"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Network related modules for glib
brew "glib-networking"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Common error values for all GnuPG components
brew "libgpg-error"
# Numerical library for C and C++
brew "gsl"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Image manipulation library
brew "jpeg", link: true
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Open h.265 video codec implementation
brew "libde265"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Conversion library
brew "libiconv"
# Implementation of the Double Ratchet cryptographic ratchet
brew "libolm"
# LLVM's OpenMP runtime library
brew "libomp"
# C library for the Public Suffix List
brew "libpsl"
# Library to render SVG files using Cairo
brew "librsvg"
# HTTP client/server library for GNOME
brew "libsoup"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Next-gen compiler infrastructure
brew "llvm"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Friendly wrapper for launchctl
brew "lunchy"
# Mac App Store command-line interface
brew "mas"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# QR Code generation
brew "qrencode"
# Cross-shell prompt for astronauts
brew "starship"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# High-performance, asynchronous messaging library
brew "zeromq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terminal UI to chat with large language models (LLM) using backends such as Ollama, and direct integrations with your favourite editor like Neovim!
brew "dustinblackman/tap/oatmeal"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Application launcher and productivity software
cask "alfred"
# Network scanner
cask "angry-ip-scanner"
# Webcam & audio device software
cask "ankerwork"
# Memory training application
cask "anki"
# Chromium based browser
cask "arc"
# Edit and manage bibliographies
cask "bibdesk"
# 3D creation suite
cask "blender"
# 3D performance benchmarking tool
cask "blender-benchmark"
# Utility to dim background/inactive content in the screen
cask "blurred"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Screen capturing tool
cask "cleanshot"
cask "color-oracle"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Trains AIs to understand and translate texts
cask "deepl"
# Collect, organise, edit and annotate documents
cask "devonthink"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-monaspace"
cask "font-noto-emoji"
cask "font-symbols-only-nerd-font"
# Free VPN client for FortiClient
cask "forticlient-vpn"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Japanese input software
cask "google-japanese-ime"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake"
# Create presentation slides from a Markdown document
cask "ia-presenter"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Tool to scan a website checking for broken links
cask "integrity"
# Menu bar calendar
cask "itsycal"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope@3"
# Open-source screen recorder built with web technology
cask "kap"
# Grammar, spelling and style suggestions in all the writing apps
cask "languagetool"
# Official client for LBRY, a decentralised file-sharing and payment network
cask "lbry"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# File system integration
cask "macfuse"
# Video format converter (transcoder)
cask "makemkv"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Organise all your reference images in one place
cask "ogdesign-eagle"
# Get up and running with large language models locally
cask "ollama"
# Control your smart light system
cask "philips-hue-sync"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# All-in-one bookmark manager
cask "raindropio"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Onion routing based messenger
cask "session"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Interior design application
cask "sweet-home3d"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# File transfer application
cask "transmit"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Virtualizer for x86 and arm64 hardware
cask "virtualbox@beta"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Web browser plugin
cask "vlc-webplugin"
# Torrent streaming application
cask "webtorrent"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Tax declaration for the fiscal year 2023
cask "wiso-steuer-2024"
# Multiplayer code editor
cask "zed"
mas "1-Click Video Converter", id: 717545086
mas "Aiko", id: 1672085276
mas "DaVinci Resolve", id: 571213070
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Draw Things", id: 6444050820
mas "Exporter", id: 1099120373
mas "Free MP4 Converter", id: 693443591
mas "Goodnotes", id: 1444383602
mas "iA Writer", id: 775737590
mas "iFinance 5", id: 1500241909
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Mela", id: 1568924476
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Proton Pass for Safari", id: 6502835663
mas "Pure Paste", id: 1611378436
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
mas "Smart Converter", id: 447513724
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Time Sink", id: 404363161
mas "Typeface", id: 1062679359
mas "Yoink", id: 457622435
vscode "activitywatch.aw-watcher-vscode"
vscode "adamvoss.vscode-languagetool"
vscode "ahmadalli.vscode-nginx-conf"
vscode "akamud.vscode-caniuse"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "anteprimorac.html-end-tag-labels"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.snapshot-tools"
vscode "azemoh.one-monokai"
vscode "bbenoist.nix"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "chrischinchilla.vale-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "codesandbox-io.codesandbox-projects"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "csstools.postcss"
vscode "cstrachan.vcard"
vscode "davidlday.languagetool-linter"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dendron.dendron"
vscode "dendron.dendron-paste-image"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fallenmax.mithril-emmet"
vscode "file-icons.file-icons"
vscode "foam.foam-vscode"
vscode "gerane.theme-tomorrownight"
vscode "ginfuru.better-nunjucks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hextorgb.hex-to-rgb"
vscode "idleberg.applescript"
vscode "jasonnutter.search-node-modules"
vscode "juanblanco.solidity"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "kamikillerto.vscode-colorize"
vscode "kotfu.bunch"
vscode "kumar-harsh.graphql-for-vscode"
vscode "liviuschera.noctis"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mehullakhanpal.file-ops"
vscode "mgmcdermott.vscode-language-babel"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "morph.rift-vscode"
vscode "mrmlnc.vscode-attrs-sorter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "quick-lint.quick-lint-js"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "sleistner.vscode-fileutils"
vscode "softwaredotcom.swdc-vscode"
vscode "styled-components.vscode-styled-components"
vscode "svanimpe.stencil"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "thenikso.github-plus-theme"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "xyc.vscode-mdx-preview"
vscode "yinfei.luahelper"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
