jorgebucaran/fisher
jorgebucaran/autopair.fish
jorgebucaran/replay.fish
edc/bass
jethrokuan/z
joshmedeski/fish-lf-icons
jethrokuan/fzf
lilyball/nix-env.fish
